In [1]:
import numpy as np
import pandas as pd

## Combining / comparing / joining / merging

### 1) assign

In [2]:
df = pd.DataFrame(data={'temp_c': [17.0, 25.0]}, index=['Portland', 'Berkeley'])
df

          temp_c
Portland    17.0
Berkeley    25.0

In [3]:
# Assign new columns to a DataFrame.

df = df.assign(temp_f = lambda x: x.temp_c * 9 / 5 + 32)
df

# df.assign(temp_f = df['temp_c'] * 9 / 5 + 32) # this is another way

          temp_c  temp_f
Portland    17.0    62.6
Berkeley    25.0    77.0

In [4]:
df = df.assign(temp_f = lambda x: x['temp_c'] * 9 / 5 + 32, temp_k = lambda x: (x['temp_f'] +  459.67) * 5 / 9)

In [5]:
df

          temp_c  temp_f  temp_k
Portland    17.0    62.6  290.15
Berkeley    25.0    77.0  298.15

In [6]:
df = df.assign(name = lambda a:['alamin', 'tania'])
df

          temp_c  temp_f  temp_k    name
Portland    17.0    62.6  290.15  alamin
Berkeley    25.0    77.0  298.15   tania

### 2) compare

In [7]:
# Compare to another DataFrame and show the differences

df = pd.DataFrame(
    {
        "col1": ["a", "a", "b", "b", "a"],
        "col2": [1.0, 2.0, 3.0, np.nan, 5.0],
        "col3": [1.0, 2.0, 3.0, 4.0, 5.0]
    },  
)

df

  col1  col2  col3
0    a   1.0   1.0
1    a   2.0   2.0
2    b   3.0   3.0
3    b   NaN   4.0
4    a   5.0   5.0

In [8]:
df2 = df.copy()

df2.loc[0, 'col1'] = 'c'

df2.loc[2, 'col3'] = 4.0

df2

  col1  col2  col3
0    c   1.0   1.0
1    a   2.0   2.0
2    b   3.0   4.0
3    b   NaN   4.0
4    a   5.0   5.0

In [9]:
# Align the differences on columns
df.compare(other=df2)

  col1       col3
  self other self other
0    a     c  NaN   NaN
2  NaN   NaN  3.0   4.0

In [10]:
# Stack the differences on rows
df.compare(df2, align_axis=0)

        col1  col3
0 self     a   NaN
  other    c   NaN
2 self   NaN   3.0
  other  NaN   4.0

In [11]:
# Keep the equal values

df.compare(df2, keep_equal=True)

  col1       col3
  self other self other
0    a     c  1.0   1.0
2    b     b  3.0   4.0

In [12]:
# Keep all original rows and columns

df.compare(df2, keep_shape=True)

  col1       col2       col3
  self other self other self other
0    a     c  NaN   NaN  NaN   NaN
1  NaN   NaN  NaN   NaN  NaN   NaN
2  NaN   NaN  NaN   NaN  3.0   4.0
3  NaN   NaN  NaN   NaN  NaN   NaN
4  NaN   NaN  NaN   NaN  NaN   NaN

In [13]:
# Keep all original rows and columns and also all original values

df.compare(df2, keep_shape=True, keep_equal=True)

  col1       col2       col3
  self other self other self other
0    a     c  1.0   1.0  1.0   1.0
1    a     a  2.0   2.0  2.0   2.0
2    b     b  3.0   3.0  3.0   4.0
3    b     b  NaN   NaN  4.0   4.0
4    a     a  5.0   5.0  5.0   5.0

### 3) join()

In [14]:
# join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False)

# Join columns of another DataFrame.

# Join columns with other DataFrame either on index or on a key column. 
# Efficiently join multiple DataFrame objects by index at once by passing a list.

data1 = {
  "name": ["Sally", "Mary", "John"],
  "age": [50, 40, 30]
}

data2 = {
  "qualified": [True, False, False]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [15]:
df1

    name  age
0  Sally   50
1   Mary   40
2   John   30

In [16]:
df2

   qualified
0       True
1      False
2      False

In [17]:
newdf = df1.join(other=df2)
newdf

    name  age  qualified
0  Sally   50       True
1   Mary   40      False
2   John   30      False

In [18]:
df = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
                   'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})
df

  key   A
0  K0  A0
1  K1  A1
2  K2  A2
3  K3  A3
4  K4  A4
5  K5  A5

In [19]:
other = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                      'B': ['B0', 'B1', 'B2']})
other

  key   B
0  K0  B0
1  K1  B1
2  K2  B2

In [20]:
# Join DataFrames using their indexes.

df.join(other=other, lsuffix='_caller', rsuffix='_other')

  key_caller   A key_other    B
0         K0  A0        K0   B0
1         K1  A1        K1   B1
2         K2  A2        K2   B2
3         K3  A3       NaN  NaN
4         K4  A4       NaN  NaN
5         K5  A5       NaN  NaN

In [21]:
df.join(other=other.set_index('key'), on='key')

  key   A    B
0  K0  A0   B0
1  K1  A1   B1
2  K2  A2   B2
3  K3  A3  NaN
4  K4  A4  NaN
5  K5  A5  NaN

In [22]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1.set_index('city',inplace=True)
df1

          temperature
city
new york           21
chicago            14
orlando            35

In [23]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2.set_index('city',inplace=True)
df2

          humidity
city
chicago         65
new york        68
orlando         75

In [24]:
df1.join(df2,lsuffix='_l', rsuffix='_r')

          temperature  humidity
city
new york           21        68
chicago            14        65
orlando            35        75

### 4) merge()

In [25]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})

df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})

In [26]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [27]:
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [28]:
# Merge df1 and df2 on the lkey and rkey columns. The value columns have the default suffixes, _x and _y, appended.

df1.merge(right=df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [29]:
df1.merge(right=df2, left_on='lkey', right_on='rkey', suffixes=('_left', '_right'))

  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

In [30]:
df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
df1

     a  b
0  foo  1
1  bar  2

In [31]:
df2

     a  c
0  foo  3
1  baz  4

In [32]:
df1.merge(right=df2, how='inner', on='a')

     a  b  c
0  foo  1  3

In [33]:
df1.merge(df2, how='left', on='a')

     a  b    c
0  foo  1  3.0
1  bar  2  NaN

In [34]:
df1.merge(df2, how='right', on='a')

     a    b  c
0  foo  1.0  3
1  baz  NaN  4

In [35]:
df1 = pd.DataFrame({'left': ['foo', 'bar']})
df2 = pd.DataFrame({'right': [7, 8]})
df1

  left
0  foo
1  bar

In [36]:
df2

   right
0      7
1      8

In [37]:
df1.merge(right=df2, how='cross')

  left  right
0  foo      7
1  foo      8
2  bar      7
3  bar      8

### 5) update()

In [38]:
# DataFrame.update(other, join='left', overwrite=True, filter_func=None, errors='ignore')

# Modify in place using non-NA values from another DataFrame.

df = pd.DataFrame({'A': [1, 2, 3],
                   'B': [400, 500, 600]})
new_df = pd.DataFrame({'B': [4, 5, 6],
                       'C': [7, 8, 9]})

In [39]:
df

   A    B
0  1  400
1  2  500
2  3  600

In [40]:
new_df

   B  C
0  4  7
1  5  8
2  6  9

In [41]:
df.update(other=new_df)

In [42]:
df
# The DataFrame’s length does not increase as a result of the update, only values at matching index/column labels are updated.

   A  B
0  1  4
1  2  5
2  3  6

In [43]:
df = pd.DataFrame({'A': ['a', 'b', 'c'],
                   'B': ['x', 'y', 'z']})

new_df = pd.DataFrame({'B': ['d', 'e', 'f', 'g', 'h', 'i']})

df

   A  B
0  a  x
1  b  y
2  c  z

In [44]:
new_df

   B
0  d
1  e
2  f
3  g
4  h
5  i

In [45]:
df.update(new_df)

In [46]:
df

   A  B
0  a  d
1  b  e
2  c  f

In [47]:
# For Series, its name attribute must be set.

df = pd.DataFrame({'A': ['a', 'b', 'c'],
                   'B': ['x', 'y', 'z']})

new_column = pd.Series(['d', 'e'], name='B', index=[0, 2])

df

   A  B
0  a  x
1  b  y
2  c  z

In [48]:
new_column

0    d
2    e
Name: B, dtype: object

In [49]:
df.update(new_column)
df

   A  B
0  a  d
1  b  y
2  c  e

In [50]:
df = pd.DataFrame({'A': ['a', 'b', 'c'],
                   'B': ['x', 'y', 'z']})

new_df = pd.DataFrame({'B': ['d', 'e']}, index=[1, 2])

df

   A  B
0  a  x
1  b  y
2  c  z

In [51]:
new_df

   B
1  d
2  e

In [52]:
df.update(new_df)
df

   A  B
0  a  x
1  b  d
2  c  e

In [53]:
# If other contains NaNs the corresponding values are not updated in the original dataframe.

df = pd.DataFrame({'A': [1, 2, 3],
                   'B': [400, 500, 600]})
new_df = pd.DataFrame({'B': [4, np.nan, 6]})

df

   A    B
0  1  400
1  2  500
2  3  600

In [54]:
new_df

     B
0  4.0
1  NaN
2  6.0

In [55]:
df.update(new_df)
df

   A      B
0  1    4.0
1  2  500.0
2  3    6.0